[
  {"id":"faquih_missingvalueworkflow_2020","abstract":"Metabolomics studies have seen a steady growth due to the development and implementation of affordable and high-quality metabolomics platforms. In large metabolite panels, measurement values are frequently missing and, if neglected or sub-optimally imputed, can cause biased study results. We provided a publicly available, user-friendly R script to streamline the imputation of missing endogenous, unannotated, and xenobiotic metabolites. We evaluated the multivariate imputation by chained equations (MICE) and k-nearest neighbors (kNN) analyses implemented in our script by simulations using measured metabolites data from the Netherlands Epidemiology of Obesity (NEO) study (n = 599). We simulated missing values in four unique metabolites from different pathways with different correlation structures in three sample sizes (599, 150, 50) with three missing percentages (15%, 30%, 60%), and using two missing mechanisms (completely at random and not at random). Based on the simulations, we found that for MICE, larger sample size was the primary factor decreasing bias and error. For kNN, the primary factor reducing bias and error was the metabolite correlation with its predictor metabolites. MICE provided consistently higher performance measures particularly for larger datasets (n > 50). In conclusion, we presented an imputation workflow in a publicly available R script to impute untargeted metabolomics data. Our simulations provided insight into the effects of sample size, percentage missing, and correlation structure on the accuracy of the two imputation methods.","accessed":{"date-parts":[[2021,5,25]]},"author":[{"family":"Faquih","given":"Tariq"},{"family":"Smeden","given":"Maarten","non-dropping-particle":"van"},{"family":"Luo","given":"Jiao"},{"family":"Cessie","given":"Saskia","non-dropping-particle":"le"},{"family":"Kastenmüller","given":"Gabi"},{"family":"Krumsiek","given":"Jan"},{"family":"Noordam","given":"Raymond"},{"family":"Heemst","given":"Diana","non-dropping-particle":"van"},{"family":"Rosendaal","given":"Frits R."},{"family":"Hylckama Vlieg","given":"Astrid","non-dropping-particle":"van"},{"family":"Willems van Dijk","given":"Ko"},{"family":"Mook-Kanamori","given":"Dennis O."}],"container-title":"Metabolites","container-title-short":"Metabolites","DOI":"10.3390/metabo10120486","ISSN":"2218-1989","issue":"12","issued":{"date-parts":[[2020,11,26]]},"PMCID":"PMC7761057","PMID":"33256233","source":"PubMed Central","title":"A Workflow for Missing Values Imputation of Untargeted Metabolomics Data","type":"article-journal","URL":"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7761057/","volume":"10"},
  {"id":"flight_timecourseexploration_2010","abstract":"In the analysis of data from high-throughput experiments, information regarding the underlying data structure provides the researcher with confidence in the appropriateness of various analysis methods. One extremely simple but powerful data visualization method is the correlation heat map, whereby correlations between experiments/conditions are calculated and represented using color. In this work, the use of correlation maps to shed light on transcription patterns from DNA microarray time course data prior to gene-level analysis is described. Using three different time course studies from the literature, it is shown how the patterns observed at the array level provide insights into the dynamics of the system under study and the experimental design.","author":[{"family":"Flight","given":"Robert M."},{"family":"Wentzell","given":"Peter D."}],"container-title":"Omics: A Journal of Integrative Biology","container-title-short":"OMICS","DOI":"10.1089/omi.2009.0096","ISSN":"1557-8100","issue":"1","issued":{"date-parts":[[2010,2]]},"language":"eng","page":"99-107","PMID":"20141332","source":"PubMed","title":"Preliminary exploration of time course DNA microarray data with correlation maps","type":"article-journal","volume":"14"},
  {"id":"franz_genemania_2018","abstract":"GeneMANIA (http://genemania.org) is a flexible user-friendly web site for generating hypotheses about gene function, analyzing gene lists and prioritizing genes for functional assays. Given a query gene list, GeneMANIA finds functionally similar genes using a wealth of genomics and proteomics data. In this mode, it weights each functional genomic dataset according to its predictive value for the query. Another use of GeneMANIA is gene function prediction. Given a single query gene, GeneMANIA finds genes likely to share function with it based on their interactions with it. Enriched Gene Ontology categories among this set can point to the function of the gene. Nine organisms are currently supported (Arabidopsis thaliana, Caenorhabditis elegans, Danio rerio, Drosophila melanogaster, Escherichia coli, Homo sapiens, Mus musculus, Rattus norvegicus and Saccharomyces cerevisiae). Hundreds of data sets and hundreds of millions of interactions have been collected from GEO, BioGRID, IRefIndex and I2D, as well as organism-specific functional genomics data sets. Users can customize their search by selecting specific data sets to query and by uploading their own data sets to analyze. We have recently updated the user interface to GeneMANIA to make it more intuitive and make more efficient use of visual space. GeneMANIA can now be used effectively on a variety of devices.","author":[{"family":"Franz","given":"Max"},{"family":"Rodriguez","given":"Harold"},{"family":"Lopes","given":"Christian"},{"family":"Zuberi","given":"Khalid"},{"family":"Montojo","given":"Jason"},{"family":"Bader","given":"Gary D."},{"family":"Morris","given":"Quaid"}],"container-title":"Nucleic Acids Research","container-title-short":"Nucleic Acids Res","DOI":"10.1093/nar/gky311","ISSN":"1362-4962","issue":"W1","issued":{"date-parts":[[2018,7,2]]},"language":"eng","page":"W60-W64","PMCID":"PMC6030815","PMID":"29912392","source":"PubMed","title":"GeneMANIA update 2018","type":"article-journal","volume":"46"},
  {"id":"fukushima_integratedomics_2009","abstract":"Understanding cellular metabolic systems is vital not only for determining the function of enzymatic genes, but also for elucidating the coordination among various metabolic pathways. In this context, high-throughput experiments can provide us with essential, albeit only partial information. Integration of metabolite profiling with other multiple 'omics' data (e.g. transcript profiling), is required to reconstruct complex networks that characterize the phenotypes in the cell. Here, we review recent approaches to integrate multiple omics data in higher plants. We especially focus on metabolomics data management, normalization, meta-omics data analysis, and an integrative approach with other omics data. Further prospects for using metabolomics and the key points to be addressed are discussed. This could be a valuable strategy for a systems-level understanding of plant systems.","author":[{"family":"Fukushima","given":"Atsushi"},{"family":"Kusano","given":"Miyako"},{"family":"Redestig","given":"Henning"},{"family":"Arita","given":"Masanori"},{"family":"Saito","given":"Kazuki"}],"container-title":"Current Opinion in Chemical Biology","container-title-short":"Curr Opin Chem Biol","DOI":"10.1016/j.cbpa.2009.09.022","ISSN":"1879-0402","issue":"5-6","issued":{"date-parts":[[2009,12]]},"language":"eng","page":"532-538","PMID":"19837627","source":"PubMed","title":"Integrated omics approaches in plant systems biology","type":"article-journal","volume":"13"},
  {"id":"gierlinski_statisticalmodels_2015","abstract":"Motivation: High-throughput RNA sequencing (RNA-seq) is now the standard method to determine differential gene expression. Identifying differentially expressed genes crucially depends on estimates of read-count variability. These estimates are typically based on statistical models such as the negative binomial distribution, which is employed by the tools edgeR, DESeq and cuffdiff. Until now, the validity of these models has usually been tested on either low-replicate RNA-seq data or simulations.Results: A 48-replicate RNA-seq experiment in yeast was performed and data tested against theoretical models. The observed gene read counts were consistent with both log-normal and negative binomial distributions, while the mean-variance relation followed the line of constant dispersion parameter of ∼0.01. The high-replicate data also allowed for strict quality control and screening of ‘bad’ replicates, which can drastically affect the gene read-count distribution.Availability and implementation: RNA-seq data have been submitted to ENA archive with project ID PRJEB5348.Contact:g.j.barton@dundee.ac.uk","accessed":{"date-parts":[[2021,5,25]]},"author":[{"family":"Gierliński","given":"Marek"},{"family":"Cole","given":"Christian"},{"family":"Schofield","given":"Pietà"},{"family":"Schurch","given":"Nicholas J."},{"family":"Sherstnev","given":"Alexander"},{"family":"Singh","given":"Vijender"},{"family":"Wrobel","given":"Nicola"},{"family":"Gharbi","given":"Karim"},{"family":"Simpson","given":"Gordon"},{"family":"Owen-Hughes","given":"Tom"},{"family":"Blaxter","given":"Mark"},{"family":"Barton","given":"Geoffrey J."}],"container-title":"Bioinformatics","container-title-short":"Bioinformatics","DOI":"10.1093/bioinformatics/btv425","ISSN":"1367-4803","issue":"22","issued":{"date-parts":[[2015,11,15]]},"page":"3625-3630","source":"Silverchair","title":"Statistical models for RNA-seq data derived from a two-condition 48-replicate experiment","type":"article-journal","URL":"https://doi.org/10.1093/bioinformatics/btv425","volume":"31"},
  {"id":"gu_complexheatmap_2016","abstract":"Summary: Parallel heatmaps with carefully designed annotation graphics are powerful for efficient visualization of patterns and relationships among high dimensional genomic data. Here we present the ComplexHeatmap package that provides rich functionalities for customizing heatmaps, arranging multiple parallel heatmaps and including user-defined annotation graphics. We demonstrate the power of ComplexHeatmap to easily reveal patterns and correlations among multiple sources of information with four real-world datasets.Availability and Implementation: The ComplexHeatmap package and documentation are freely available from the Bioconductor project: http://www.bioconductor.org/packages/devel/bioc/html/ComplexHeatmap.html.Contact:m.schlesner@dkfz.deSupplementary information:Supplementary data are available at Bioinformatics online.","accessed":{"date-parts":[[2021,5,25]]},"author":[{"family":"Gu","given":"Zuguang"},{"family":"Eils","given":"Roland"},{"family":"Schlesner","given":"Matthias"}],"container-title":"Bioinformatics","container-title-short":"Bioinformatics","DOI":"10.1093/bioinformatics/btw313","ISSN":"1367-4803","issue":"18","issued":{"date-parts":[[2016,9,15]]},"page":"2847-2849","source":"Silverchair","title":"Complex heatmaps reveal patterns and correlations in multidimensional genomic data","type":"article-journal","URL":"https://doi.org/10.1093/bioinformatics/btw313","volume":"32"},
  {"id":"langfelder_wgcna_2008","abstract":"Correlation networks are increasingly being used in bioinformatics applications. For example, weighted gene co-expression network analysis is a systems biology method for describing the correlation patterns among genes across microarray samples. Weighted correlation network analysis (WGCNA) can be used for finding clusters (modules) of highly correlated genes, for summarizing such clusters using the module eigengene or an intramodular hub gene, for relating modules to one another and to external sample traits (using eigengene network methodology), and for calculating module membership measures. Correlation networks facilitate network based gene screening methods that can be used to identify candidate biomarkers or therapeutic targets. These methods have been successfully applied in various biological contexts, e.g. cancer, mouse genetics, yeast genetics, and analysis of brain imaging data. While parts of the correlation network methodology have been described in separate publications, there is a need to provide a user-friendly, comprehensive, and consistent software implementation and an accompanying tutorial.","accessed":{"date-parts":[[2021,5,25]]},"author":[{"family":"Langfelder","given":"Peter"},{"family":"Horvath","given":"Steve"}],"container-title":"BMC Bioinformatics","container-title-short":"BMC Bioinformatics","DOI":"10.1186/1471-2105-9-559","ISSN":"1471-2105","issue":"1","issued":{"date-parts":[[2008,12,29]]},"page":"559","source":"BioMed Central","title":"WGCNA: an R package for weighted correlation network analysis","title-short":"WGCNA","type":"article-journal","URL":"https://doi.org/10.1186/1471-2105-9-559","volume":"9"},
  {"id":"pearson_notes_1920","accessed":{"date-parts":[[2021,5,25]]},"author":[{"family":"PEARSON","given":"KARL"}],"container-title":"Biometrika","container-title-short":"Biometrika","DOI":"10.1093/biomet/13.1.25","ISSN":"0006-3444","issue":"1","issued":{"date-parts":[[1920,10,1]]},"page":"25-45","source":"Silverchair","title":"NOTES ON THE HISTORY OF CORRELATION","type":"article-journal","URL":"https://doi.org/10.1093/biomet/13.1.25","volume":"13"},
  {"id":"rodgers_13_1988","abstract":"In 1885, Sir Francis Galton first defined the term “regression” and completed the theory of bivariate correlation. A decade later, Karl Pearson developed the index that we still use to measure correlation, Pearson's r. Our article is written in recognition of the 100th anniversary of Galton's first discussion of regression and correlation. We begin with a brief history. Then we present 13 different formulas, each of which represents a different computational and conceptual definition of r. Each formula suggests a different way of thinking about this index, from algebraic, geometric, and trigonometric settings. We show that Pearson's r (or simple functions of r) may variously be thought of as a special type of mean, a special type of variance, the ratio of two means, the ratio of two variances, the slope of a line, the cosine of an angle, and the tangent to an ellipse, and may be looked at from several other interesting perspectives.","accessed":{"date-parts":[[2021,5,25]]},"author":[{"family":"Rodgers","given":"Joseph Lee"},{"family":"Nicewander","given":"W. Alan"}],"container-title":"The American Statistician","DOI":"10.1080/00031305.1988.10475524","ISSN":"0003-1305","issue":"1","issued":{"date-parts":[[1988,2,1]]},"note":"_eprint: https://doi.org/10.1080/00031305.1988.10475524","page":"59-66","publisher":"Taylor & Francis","source":"Taylor and Francis+NEJM","title":"Thirteen Ways to Look at the Correlation Coefficient","type":"article-journal","URL":"https://doi.org/10.1080/00031305.1988.10475524","volume":"42"},
  {"id":"szklarczyk_string_2017","abstract":"A system-wide understanding of cellular function requires knowledge of all functional interactions between the expressed proteins. The STRING database aims to collect and integrate this information, by consolidating known and predicted protein-protein association data for a large number of organisms. The associations in STRING include direct (physical) interactions, as well as indirect (functional) interactions, as long as both are specific and biologically meaningful. Apart from collecting and reassessing available experimental data on protein-protein interactions, and importing known pathways and protein complexes from curated databases, interaction predictions are derived from the following sources: (i) systematic co-expression analysis, (ii) detection of shared selective signals across genomes, (iii) automated text-mining of the scientific literature and (iv) computational transfer of interaction knowledge between organisms based on gene orthology. In the latest version 10.5 of STRING, the biggest changes are concerned with data dissemination: the web frontend has been completely redesigned to reduce dependency on outdated browser technologies, and the database can now also be queried from inside the popular Cytoscape software framework. Further improvements include automated background analysis of user inputs for functional enrichments, and streamlined download options. The STRING resource is available online, at http://string-db.org/.","author":[{"family":"Szklarczyk","given":"Damian"},{"family":"Morris","given":"John H."},{"family":"Cook","given":"Helen"},{"family":"Kuhn","given":"Michael"},{"family":"Wyder","given":"Stefan"},{"family":"Simonovic","given":"Milan"},{"family":"Santos","given":"Alberto"},{"family":"Doncheva","given":"Nadezhda T."},{"family":"Roth","given":"Alexander"},{"family":"Bork","given":"Peer"},{"family":"Jensen","given":"Lars J."},{"family":"Mering","given":"Christian","non-dropping-particle":"von"}],"container-title":"Nucleic Acids Research","container-title-short":"Nucleic Acids Res","DOI":"10.1093/nar/gkw937","ISSN":"1362-4962","issue":"D1","issued":{"date-parts":[[2017,1,4]]},"language":"eng","page":"D362-D368","PMCID":"PMC5210637","PMID":"27924014","source":"PubMed","title":"The STRING database in 2017: quality-controlled protein-protein association networks, made broadly accessible","title-short":"The STRING database in 2017","type":"article-journal","volume":"45"}
]
