[
  {"id":"alvoRankCorrelationMethods1995","accessed":{"date-parts":[[2021,6,18]]},"author":[{"family":"Alvo","given":"Mayer"},{"family":"Cabilio","given":"Paul"}],"citation-key":"alvoRankCorrelationMethods1995","container-title":"Canadian Journal of Statistics","container-title-short":"Can. J. Statistics","DOI":"10.2307/3315379","ISSN":"03195724, 1708945X","issue":"4","issued":{"date-parts":[[1995,12]]},"language":"en","page":"345-358","source":"DOI.org (Crossref)","title":"Rank correlation methods for missing data","type":"article-journal","URL":"http://doi.wiley.com/10.2307/3315379","volume":"23"},
  {"id":"bartonSNF2KnockoutYeast2015","abstract":"These data are RNA-seq read counts for 48 biological replicates of SNF2 yeast knock-out. The reads were aligned to the Saccharomyces cerevisiae genome with Tophat and gene counts determined with htseq-count. Reference genome and gene annotations were taken from Ensembl. See the linked papers for more details and the source of the raw data.","accessed":{"date-parts":[[2021,12,18]]},"author":[{"family":"Barton","given":"Geoffrey"},{"family":"Blaxter","given":"Mark"},{"family":"Cole","given":"Christian"},{"family":"Gharbi","given":"Karim"},{"family":"Gierliński","given":"Marek"},{"family":"Schofield","given":"Pieta"},{"family":"Schurch","given":"Nick"},{"family":"Vijender Singh","given":""},{"family":"Wrobel","given":"Nicola"}],"citation-key":"bartonSNF2KnockoutYeast2015","DOI":"10.6084/M9.FIGSHARE.1425502.V1","issued":{"date-parts":[[2015]]},"page":"0 Bytes","publisher":"figshare","source":"DOI.org (Datacite)","title":"SNF2 knock-out yeast gene read counts from a 48 replicate experiment","type":"dataset","URL":"https://figshare.com/articles/dataset/SNF2_knock_out_yeast_gene_read_counts_from_a_48_replicate_experiment/1425502/1"},
  {"id":"bartonWildtypeYeastGene2015","abstract":"These data are RNA-seq read counts for 48 biological replicates of wild-type yeast. The reads were aligned to the Saccharomyces cerevisiae genome with Tophat and gene counts determined with htseq-count. Reference genome and gene annotations were taken from Ensembl. See the linked papers for more details and the source for the raw data.","accessed":{"date-parts":[[2021,12,18]]},"author":[{"family":"Barton","given":"Geoffrey"},{"family":"Blaxter","given":"Mark"},{"family":"Cole","given":"Christian"},{"family":"Gharbi","given":"Karim"},{"family":"Gierliński","given":"Marek"},{"family":"Schofield","given":"Pieta"},{"family":"Schurch","given":"Nick"},{"family":"Vijender Singh","given":""},{"family":"Wrobel","given":"Nicola"}],"citation-key":"bartonWildtypeYeastGene2015","DOI":"10.6084/M9.FIGSHARE.1425503.V1","issued":{"date-parts":[[2015]]},"page":"0 Bytes","publisher":"figshare","source":"DOI.org (Datacite)","title":"Wild-type yeast gene read counts from 48 replicate experiment","type":"dataset","URL":"https://figshare.com/articles/dataset/Wild_type_yeast_gene_read_counts_from_48_replicate_experiment/1425503/1"},
  {"id":"chenCellularOriginsEGFRDriven2021","abstract":"Targeting the epidermal growth factor receptor (EGFR) with tyrosine kinase inhibitors (TKIs) is one of the major precision medicine treatment options for lung adenocarcinoma. Due to common development of drug resistance to first- and second-generation TKIs, third-generation inhibitors, including osimertinib and rociletinib, have been developed. A model of EGFR-driven lung cancer and a method to develop tumors of distinct epigenetic states through 3D organotypic cultures are described here. It is discovered that activation of the EGFR T790M/L858R mutation in lung epithelial cells can drive lung cancers with alveolar or bronchiolar features, which can originate from alveolar type 2 (AT2) cells or bronchioalveolar stem cells, but not basal cells or club cells of the trachea. It is also demonstrated that these clones are able to retain their epigenetic differences through passaging orthotopically in mice and crucially that they have distinct drug vulnerabilities. This work serves as a blueprint for exploring how epigenetics can be used to stratify patients for precision medicine decisions.","accessed":{"date-parts":[[2022,1,14]]},"author":[{"family":"Chen","given":"Fan"},{"family":"Liu","given":"Jinpeng"},{"family":"Flight","given":"Robert M."},{"family":"Naughton","given":"Kassandra J."},{"family":"Lukyanchuk","given":"Alexsandr"},{"family":"Edgin","given":"Abigail R."},{"family":"Song","given":"Xiulong"},{"family":"Zhang","given":"Haikuo"},{"family":"Wong","given":"Kwok-Kin"},{"family":"Moseley","given":"Hunter N. B."},{"family":"Wang","given":"Chi"},{"family":"Brainson","given":"Christine F."}],"citation-key":"chenCellularOriginsEGFRDriven2021","container-title":"Advanced Science","DOI":"10.1002/advs.202101999","ISSN":"2198-3844","issue":"22","issued":{"date-parts":[[2021]]},"language":"en","note":"_eprint: https://onlinelibrary.wiley.com/doi/pdf/10.1002/advs.202101999","page":"2101999","source":"Wiley Online Library","title":"Cellular Origins of EGFR-Driven Lung Cancer Cells Determine Sensitivity to Therapy","type":"article-journal","URL":"https://onlinelibrary.wiley.com/doi/abs/10.1002/advs.202101999","volume":"8"},
  {"id":"coleProfilingDifferentialGene2021","abstract":"Code base for profiling highly replicated differential gene expression RNA-seq.","accessed":{"date-parts":[[2021,12,7]]},"author":[{"family":"Cole","given":"Christian"},{"family":"Gierlinski","given":"Marek"},{"family":"Schofield","given":"Pieta"},{"family":"Schurch","given":"Nicholas"}],"citation-key":"coleProfilingDifferentialGene2021","genre":"Perl","issued":{"date-parts":[[2021,1,6]]},"original-date":{"date-parts":[[2016,3,16]]},"publisher":"Geoff Barton's Computational Biology Group","source":"GitHub","title":"Profiling Differential Gene Expression with a 48 replicate experiment","type":"book","URL":"https://github.com/bartongroup/profDGE48"},
  {"id":"collado-torres_recount2_2017","accessed":{"date-parts":[[2021,6,2]]},"author":[{"family":"Collado-Torres","given":"Leonardo"},{"family":"Nellore","given":"Abhinav"},{"family":"Kammers","given":"Kai"},{"family":"Ellis","given":"Shannon E."},{"family":"Taub","given":"Margaret A."},{"family":"Hansen","given":"Kasper D."},{"family":"Jaffe","given":"Andrew E."},{"family":"Langmead","given":"Ben"},{"family":"Leek","given":"Jeffrey T."}],"citation-key":"collado-torres_recount2_2017","container-title":"Nature Biotechnology","container-title-short":"Nat Biotechnol","DOI":"10.1038/nbt.3838","ISSN":"1546-1696","issue":"4","issued":{"date-parts":[[2017,4]]},"language":"en","number":"4","page":"319-321","publisher":"Nature Publishing Group","source":"www.nature.com","title":"Reproducible RNA-seq analysis using recount2","type":"article-journal","URL":"https://www.nature.com/articles/nbt.3838","volume":"35"},
  {"id":"eddelbuettel_extendingrcpp_2018","abstract":"R has always provided an application programming interface (API) for extensions. Based on the C language, it uses a number of macros and other low-level constructs to exchange data structures between the R process and any dynamically loaded component modules authors added to it. With the introduction of the Rcpp package, and its later refinements, this process has become considerably easier yet also more robust. By now, Rcpp has become the most popular extension mechanism for R. This article introduces Rcpp, and illustrates with several examples how the Rcpp Attributes mechanism in particular eases the transition of objects between R and C++ code. Supplementary materials for this article are available online.","accessed":{"date-parts":[[2021,5,26]]},"author":[{"family":"Eddelbuettel","given":"Dirk"},{"family":"Balamuta","given":"James Joseph"}],"citation-key":"eddelbuettel_extendingrcpp_2018","container-title":"The American Statistician","DOI":"10.1080/00031305.2017.1375990","ISSN":"0003-1305","issue":"1","issued":{"date-parts":[[2018,1,2]]},"note":"_eprint: https://doi.org/10.1080/00031305.2017.1375990","page":"28-36","publisher":"Taylor & Francis","source":"Taylor and Francis+NEJM","title":"Extending R with C++: A Brief Introduction to Rcpp","title-short":"Extending R with C++","type":"article-journal","URL":"https://doi.org/10.1080/00031305.2017.1375990","volume":"72"},
  {"id":"eddelbuettel_rcppseamless_2011","accessed":{"date-parts":[[2021,5,26]]},"author":[{"family":"Eddelbuettel","given":"Dirk"},{"family":"Francois","given":"Romain"}],"citation-key":"eddelbuettel_rcppseamless_2011","container-title":"Journal of Statistical Software","DOI":"10.18637/jss.v040.i08","ISSN":"1548-7660","issue":"1","issued":{"date-parts":[[2011,4,13]]},"language":"en","number":"1","page":"1-18","source":"www.jstatsoft.org","title":"Rcpp: Seamless R and C++ Integration","title-short":"Rcpp","type":"article-journal","URL":"https://www.jstatsoft.org/index.php/jss/article/view/v040i08","volume":"40"},
  {"id":"eddelbuettel_seamlessbook_2013","abstract":"Rcpp is the glue that binds the power and versatility of R with the speed and efficiency of C++. With Rcpp, the transfer of data between R and C++ is nearly seamless, and high-performance statistical computing is finally accessible to most R users. Rcpp should be part of every statistician's toolbox. -- Michael Braun, MIT Sloan School of Management \"Seamless R and C++ integration with Rcpp\" is simply a wonderful book. For anyone who uses C/C++ and R, it is an indispensable resource. The writing is outstanding. A huge bonus is the section on applications. This section covers the matrix packages Armadillo and Eigen and the GNU Scientific Library as well as RInside which enables you to use R inside C++. These applications are what most of us need to know to really do scientific programming with R and C++. I love this book. -- Robert McCulloch, University of Chicago Booth School of Business Rcpp is now considered an essential package for anybody doing serious computational research using R. Dirk's book is an excellent companion and takes the reader from a gentle introduction to more advanced applications via numerous examples and efficiency enhancing gems. The book is packed with all you might have ever wanted to know about Rcpp, its cousins (RcppArmadillo, RcppEigen .etc.), modules, package development and sugar. Overall, this book is a must-have on your shelf. -- Sanjog Misra, UCLA Anderson School of ManagementThe Rcpp package represents a major leap forward for scientific computations with R. With very few lines of C++ code, one has R's data structures readily at hand for further computations in C++. Hence, high-level numerical programming can be made in C++ almost as easily as in R, but often with a substantial speed gain. Dirk is a crucial person in these developments, and his book takes the reader from the first fragile steps on to using the full Rcpp machinery. A very recommended book! -- Søren Højsgaard, Department of Mathematical Sciences, Aalborg University, Denmark \"Seamless R and C ++ Integration with Rcpp\" provides the first comprehensive introduction to Rcpp. Rcpp has become the most widely-used language extension for R, and is deployed by over one-hundred different CRAN and BioConductor packages. Rcpp permits users to pass scalars, vectors, matrices, list or entire R objects back and forth between R and C++ with ease. This brings the depth of the R analysis framework together with the power, speed, and efficiency of C++.Dirk Eddelbuettel has been a contributor to CRAN for over a decade and maintains around twenty packages. He is the Debian/Ubuntu maintainer for R and other quantitative software, edits the CRAN Task Views for Finance and High-Performance Computing, is a co-founder of the annual R/Finance conference, and an editor of the Journal of Statistical Software. He holds a Ph.D. in Mathematical Economics from EHESS (Paris), and works in Chicago as a Senior Quantitative Analyst.","accessed":{"date-parts":[[2021,5,26]]},"author":[{"family":"Eddelbuettel","given":"Dirk"}],"citation-key":"eddelbuettel_seamlessbook_2013","collection-title":"Use R!","DOI":"10.1007/978-1-4614-6868-4","event-place":"New York","ISBN":"978-1-4614-6867-7","issued":{"date-parts":[[2013]]},"language":"en","publisher":"Springer-Verlag","publisher-place":"New York","source":"www.springer.com","title":"Seamless R and C++ Integration with Rcpp","type":"book","URL":"https://www.springer.com/gp/book/9781461468677"},
  {"id":"faquih_missingvalueworkflow_2020","abstract":"Metabolomics studies have seen a steady growth due to the development and implementation of affordable and high-quality metabolomics platforms. In large metabolite panels, measurement values are frequently missing and, if neglected or sub-optimally imputed, can cause biased study results. We provided a publicly available, user-friendly R script to streamline the imputation of missing endogenous, unannotated, and xenobiotic metabolites. We evaluated the multivariate imputation by chained equations (MICE) and k-nearest neighbors (kNN) analyses implemented in our script by simulations using measured metabolites data from the Netherlands Epidemiology of Obesity (NEO) study (n = 599). We simulated missing values in four unique metabolites from different pathways with different correlation structures in three sample sizes (599, 150, 50) with three missing percentages (15%, 30%, 60%), and using two missing mechanisms (completely at random and not at random). Based on the simulations, we found that for MICE, larger sample size was the primary factor decreasing bias and error. For kNN, the primary factor reducing bias and error was the metabolite correlation with its predictor metabolites. MICE provided consistently higher performance measures particularly for larger datasets (n > 50). In conclusion, we presented an imputation workflow in a publicly available R script to impute untargeted metabolomics data. Our simulations provided insight into the effects of sample size, percentage missing, and correlation structure on the accuracy of the two imputation methods.","accessed":{"date-parts":[[2021,5,25]]},"author":[{"family":"Faquih","given":"Tariq"},{"family":"Smeden","given":"Maarten","non-dropping-particle":"van"},{"family":"Luo","given":"Jiao"},{"family":"Cessie","given":"Saskia","non-dropping-particle":"le"},{"family":"Kastenmüller","given":"Gabi"},{"family":"Krumsiek","given":"Jan"},{"family":"Noordam","given":"Raymond"},{"family":"Heemst","given":"Diana","non-dropping-particle":"van"},{"family":"Rosendaal","given":"Frits R."},{"family":"Hylckama Vlieg","given":"Astrid","non-dropping-particle":"van"},{"family":"Willems van Dijk","given":"Ko"},{"family":"Mook-Kanamori","given":"Dennis O."}],"citation-key":"faquih_missingvalueworkflow_2020","container-title":"Metabolites","container-title-short":"Metabolites","DOI":"10.3390/metabo10120486","ISSN":"2218-1989","issue":"12","issued":{"date-parts":[[2020,11,26]]},"PMCID":"PMC7761057","PMID":"33256233","source":"PubMed Central","title":"A Workflow for Missing Values Imputation of Untargeted Metabolomics Data","type":"article-journal","URL":"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7761057/","volume":"10"},
  {"id":"flight_timecourseexploration_2010","abstract":"In the analysis of data from high-throughput experiments, information regarding the underlying data structure provides the researcher with confidence in the appropriateness of various analysis methods. One extremely simple but powerful data visualization method is the correlation heat map, whereby correlations between experiments/conditions are calculated and represented using color. In this work, the use of correlation maps to shed light on transcription patterns from DNA microarray time course data prior to gene-level analysis is described. Using three different time course studies from the literature, it is shown how the patterns observed at the array level provide insights into the dynamics of the system under study and the experimental design.","author":[{"family":"Flight","given":"Robert M."},{"family":"Wentzell","given":"Peter D."}],"citation-key":"flight_timecourseexploration_2010","container-title":"Omics: A Journal of Integrative Biology","container-title-short":"OMICS","DOI":"10.1089/omi.2009.0096","ISSN":"1557-8100","issue":"1","issued":{"date-parts":[[2010,2]]},"language":"eng","page":"99-107","PMID":"20141332","source":"PubMed","title":"Preliminary exploration of time course DNA microarray data with correlation maps","type":"article-journal","volume":"14"},
  {"id":"flightICIKendallTau2022","abstract":"ICIKendallTau version used in the manuscript Information-Content-Informed Kendall-tau Correlation: Utilizing Missing Values Robert M Flight, Praneeth S Bhatt, Hunter NB Moseley","author":[{"family":"Flight","given":"Robert M."},{"family":"Moseley","given":"Hunter N. B."}],"citation-key":"flightICIKendallTau2022","issued":{"date-parts":[[2022,2]]},"title":"ICIKendallTau","type":"document","URL":"https://doi.org/10.5281/zenodo.6311002"},
  {"id":"flightManuscriptICIKendallTau2022","author":[{"family":"Flight","given":"Robert M."},{"family":"Moseley","given":"Hunter N. B."}],"citation-key":"flightManuscriptICIKendallTau2022","issued":{"date-parts":[[2022,2]]},"title":"manuscript.ICIKendallTau","type":"document","URL":"https://dx.doi.org/10.5281/zenodo.6309187"},
  {"id":"franz_genemania_2018","abstract":"GeneMANIA (http://genemania.org) is a flexible user-friendly web site for generating hypotheses about gene function, analyzing gene lists and prioritizing genes for functional assays. Given a query gene list, GeneMANIA finds functionally similar genes using a wealth of genomics and proteomics data. In this mode, it weights each functional genomic dataset according to its predictive value for the query. Another use of GeneMANIA is gene function prediction. Given a single query gene, GeneMANIA finds genes likely to share function with it based on their interactions with it. Enriched Gene Ontology categories among this set can point to the function of the gene. Nine organisms are currently supported (Arabidopsis thaliana, Caenorhabditis elegans, Danio rerio, Drosophila melanogaster, Escherichia coli, Homo sapiens, Mus musculus, Rattus norvegicus and Saccharomyces cerevisiae). Hundreds of data sets and hundreds of millions of interactions have been collected from GEO, BioGRID, IRefIndex and I2D, as well as organism-specific functional genomics data sets. Users can customize their search by selecting specific data sets to query and by uploading their own data sets to analyze. We have recently updated the user interface to GeneMANIA to make it more intuitive and make more efficient use of visual space. GeneMANIA can now be used effectively on a variety of devices.","author":[{"family":"Franz","given":"Max"},{"family":"Rodriguez","given":"Harold"},{"family":"Lopes","given":"Christian"},{"family":"Zuberi","given":"Khalid"},{"family":"Montojo","given":"Jason"},{"family":"Bader","given":"Gary D."},{"family":"Morris","given":"Quaid"}],"citation-key":"franz_genemania_2018","container-title":"Nucleic Acids Research","container-title-short":"Nucleic Acids Res","DOI":"10.1093/nar/gky311","ISSN":"1362-4962","issue":"W1","issued":{"date-parts":[[2018,7,2]]},"language":"eng","page":"W60-W64","PMCID":"PMC6030815","PMID":"29912392","source":"PubMed","title":"GeneMANIA update 2018","type":"article-journal","volume":"46"},
  {"id":"fukushima_integratedomics_2009","abstract":"Understanding cellular metabolic systems is vital not only for determining the function of enzymatic genes, but also for elucidating the coordination among various metabolic pathways. In this context, high-throughput experiments can provide us with essential, albeit only partial information. Integration of metabolite profiling with other multiple 'omics' data (e.g. transcript profiling), is required to reconstruct complex networks that characterize the phenotypes in the cell. Here, we review recent approaches to integrate multiple omics data in higher plants. We especially focus on metabolomics data management, normalization, meta-omics data analysis, and an integrative approach with other omics data. Further prospects for using metabolomics and the key points to be addressed are discussed. This could be a valuable strategy for a systems-level understanding of plant systems.","author":[{"family":"Fukushima","given":"Atsushi"},{"family":"Kusano","given":"Miyako"},{"family":"Redestig","given":"Henning"},{"family":"Arita","given":"Masanori"},{"family":"Saito","given":"Kazuki"}],"citation-key":"fukushima_integratedomics_2009","container-title":"Current Opinion in Chemical Biology","container-title-short":"Curr Opin Chem Biol","DOI":"10.1016/j.cbpa.2009.09.022","ISSN":"1879-0402","issue":"5-6","issued":{"date-parts":[[2009,12]]},"language":"eng","page":"532-538","PMID":"19837627","source":"PubMed","title":"Integrated omics approaches in plant systems biology","type":"article-journal","volume":"13"},
  {"id":"gierlinski_statisticalmodels_2015","abstract":"Motivation: High-throughput RNA sequencing (RNA-seq) is now the standard method to determine differential gene expression. Identifying differentially expressed genes crucially depends on estimates of read-count variability. These estimates are typically based on statistical models such as the negative binomial distribution, which is employed by the tools edgeR, DESeq and cuffdiff. Until now, the validity of these models has usually been tested on either low-replicate RNA-seq data or simulations.Results: A 48-replicate RNA-seq experiment in yeast was performed and data tested against theoretical models. The observed gene read counts were consistent with both log-normal and negative binomial distributions, while the mean-variance relation followed the line of constant dispersion parameter of ∼0.01. The high-replicate data also allowed for strict quality control and screening of ‘bad’ replicates, which can drastically affect the gene read-count distribution.Availability and implementation: RNA-seq data have been submitted to ENA archive with project ID PRJEB5348.Contact:g.j.barton@dundee.ac.uk","accessed":{"date-parts":[[2021,5,25]]},"author":[{"family":"Gierliński","given":"Marek"},{"family":"Cole","given":"Christian"},{"family":"Schofield","given":"Pietà"},{"family":"Schurch","given":"Nicholas J."},{"family":"Sherstnev","given":"Alexander"},{"family":"Singh","given":"Vijender"},{"family":"Wrobel","given":"Nicola"},{"family":"Gharbi","given":"Karim"},{"family":"Simpson","given":"Gordon"},{"family":"Owen-Hughes","given":"Tom"},{"family":"Blaxter","given":"Mark"},{"family":"Barton","given":"Geoffrey J."}],"citation-key":"gierlinski_statisticalmodels_2015","container-title":"Bioinformatics","container-title-short":"Bioinformatics","DOI":"10.1093/bioinformatics/btv425","ISSN":"1367-4803","issue":"22","issued":{"date-parts":[[2015,11,15]]},"page":"3625-3630","source":"Silverchair","title":"Statistical models for RNA-seq data derived from a two-condition 48-replicate experiment","type":"article-journal","URL":"https://doi.org/10.1093/bioinformatics/btv425","volume":"31"},
  {"id":"gleasonProposalHandlingMissing1975","accessed":{"date-parts":[[2021,6,18]]},"author":[{"family":"Gleason","given":"Terry C."},{"family":"Staelin","given":"Richard"}],"citation-key":"gleasonProposalHandlingMissing1975","container-title":"Psychometrika","container-title-short":"Psychometrika","DOI":"10.1007/BF02291569","ISSN":"0033-3123, 1860-0980","issue":"2","issued":{"date-parts":[[1975,6]]},"language":"en","page":"229-252","source":"DOI.org (Crossref)","title":"A proposal for handling missing data","type":"article-journal","URL":"http://link.springer.com/10.1007/BF02291569","volume":"40"},
  {"id":"gu_complexheatmap_2016","abstract":"Summary: Parallel heatmaps with carefully designed annotation graphics are powerful for efficient visualization of patterns and relationships among high dimensional genomic data. Here we present the ComplexHeatmap package that provides rich functionalities for customizing heatmaps, arranging multiple parallel heatmaps and including user-defined annotation graphics. We demonstrate the power of ComplexHeatmap to easily reveal patterns and correlations among multiple sources of information with four real-world datasets.Availability and Implementation: The ComplexHeatmap package and documentation are freely available from the Bioconductor project: http://www.bioconductor.org/packages/devel/bioc/html/ComplexHeatmap.html.Contact:m.schlesner@dkfz.deSupplementary information:Supplementary data are available at Bioinformatics online.","accessed":{"date-parts":[[2021,5,25]]},"author":[{"family":"Gu","given":"Zuguang"},{"family":"Eils","given":"Roland"},{"family":"Schlesner","given":"Matthias"}],"citation-key":"gu_complexheatmap_2016","container-title":"Bioinformatics","container-title-short":"Bioinformatics","DOI":"10.1093/bioinformatics/btw313","ISSN":"1367-4803","issue":"18","issued":{"date-parts":[[2016,9,15]]},"page":"2847-2849","source":"Silverchair","title":"Complex heatmaps reveal patterns and correlations in multidimensional genomic data","type":"article-journal","URL":"https://doi.org/10.1093/bioinformatics/btw313","volume":"32"},
  {"id":"kendall_newmeasure_1938","accessed":{"date-parts":[[2021,5,26]]},"author":[{"family":"Kendall","given":"M. G."}],"citation-key":"kendall_newmeasure_1938","container-title":"Biometrika","DOI":"10.2307/2332226","ISSN":"0006-3444","issue":"1/2","issued":{"date-parts":[[1938]]},"page":"81-93","publisher":"[Oxford University Press, Biometrika Trust]","source":"JSTOR","title":"A New Measure of Rank Correlation","type":"article-journal","URL":"https://www.jstor.org/stable/2332226","volume":"30"},
  {"id":"kendall_rankcorrelationbook_1948","author":[{"family":"Kendall","given":"Maurice G."}],"citation-key":"kendall_rankcorrelationbook_1948","edition":"First Edition","issued":{"date-parts":[[1948,1,1]]},"language":"English","number-of-pages":"160","publisher":"C. Griffin","source":"Amazon","title":"Rank correlation methods","type":"book"},
  {"id":"kendall_treatment_ties_1945","author":[{"family":"Kendall","given":"M. G."}],"citation-key":"kendall_treatment_ties_1945","container-title":"Biometrika","container-title-short":"Biometrika","DOI":"10.1093/biomet/33.3.239","ISSN":"0006-3444","issued":{"date-parts":[[1945,11]]},"language":"eng","page":"239-251","PMID":"21006841","source":"PubMed","title":"The treatment of ties in ranking problems","type":"article-journal","volume":"33"},
  {"id":"kimTopHat2AccurateAlignment2013","abstract":"TopHat is a popular spliced aligner for RNA-sequence (RNA-seq) experiments. In this paper, we describe TopHat2, which incorporates many significant enhancements to TopHat. TopHat2 can align reads of various lengths produced by the latest sequencing technologies, while allowing for variable-length indels with respect to the reference genome. In addition to de novo spliced alignment, TopHat2 can align reads across fusion breaks, which can occur after genomic translocations. TopHat2 combines the ability to identify novel splice sites with direct mapping to known transcripts, producing sensitive and accurate alignments, even for highly repetitive genomes or in the presence of pseudogenes. TopHat2 is available at http://ccb.jhu.edu/software/tophat.","accessed":{"date-parts":[[2021,7,7]]},"author":[{"family":"Kim","given":"Daehwan"},{"family":"Pertea","given":"Geo"},{"family":"Trapnell","given":"Cole"},{"family":"Pimentel","given":"Harold"},{"family":"Kelley","given":"Ryan"},{"family":"Salzberg","given":"Steven L."}],"citation-key":"kimTopHat2AccurateAlignment2013","container-title":"Genome Biology","container-title-short":"Genome Biology","DOI":"10.1186/gb-2013-14-4-r36","ISSN":"1474-760X","issue":"4","issued":{"date-parts":[[2013,4,25]]},"page":"R36","source":"BioMed Central","title":"TopHat2: accurate alignment of transcriptomes in the presence of insertions, deletions and gene fusions","title-short":"TopHat2","type":"article-journal","URL":"https://doi.org/10.1186/gb-2013-14-4-r36","volume":"14"},
  {"id":"knight_mergesortkendall_1966","abstract":"Adapting the usual manual methods of computing Kendall's tau to automatic computation result in a running time of order N<sup>2</sup>. A method is described with running time of order N log N.","accessed":{"date-parts":[[2021,5,26]]},"author":[{"family":"Knight","given":"William R."}],"citation-key":"knight_mergesortkendall_1966","container-title":"Journal of the American Statistical Association","DOI":"10.2307/2282833","ISSN":"0162-1459","issue":"314","issued":{"date-parts":[[1966]]},"page":"436-439","publisher":"[American Statistical Association, Taylor & Francis, Ltd.]","source":"JSTOR","title":"A Computer Method for Calculating Kendall's Tau with Ungrouped Data","type":"article-journal","URL":"https://www.jstor.org/stable/2282833","volume":"61"},
  {"id":"landau_drakepackage_2018","abstract":"Landau, (2018). The drake R package: a pipeline toolkit for reproducibility and high-performance computing. Journal of Open Source Software, 3(21), 550, https://doi.org/10.21105/joss.00550","accessed":{"date-parts":[[2021,5,26]]},"author":[{"family":"Landau","given":"William Michael"}],"citation-key":"landau_drakepackage_2018","container-title":"Journal of Open Source Software","DOI":"10.21105/joss.00550","ISSN":"2475-9066","issue":"21","issued":{"date-parts":[[2018,1,26]]},"language":"en","page":"550","source":"joss.theoj.org","title":"The drake R package: a pipeline toolkit for reproducibility and high-performance computing","title-short":"The drake R package","type":"article-journal","URL":"https://joss.theoj.org/papers/10.21105/joss.00550","volume":"3"},
  {"id":"langfelder_wgcna_2008","abstract":"Correlation networks are increasingly being used in bioinformatics applications. For example, weighted gene co-expression network analysis is a systems biology method for describing the correlation patterns among genes across microarray samples. Weighted correlation network analysis (WGCNA) can be used for finding clusters (modules) of highly correlated genes, for summarizing such clusters using the module eigengene or an intramodular hub gene, for relating modules to one another and to external sample traits (using eigengene network methodology), and for calculating module membership measures. Correlation networks facilitate network based gene screening methods that can be used to identify candidate biomarkers or therapeutic targets. These methods have been successfully applied in various biological contexts, e.g. cancer, mouse genetics, yeast genetics, and analysis of brain imaging data. While parts of the correlation network methodology have been described in separate publications, there is a need to provide a user-friendly, comprehensive, and consistent software implementation and an accompanying tutorial.","accessed":{"date-parts":[[2021,5,25]]},"author":[{"family":"Langfelder","given":"Peter"},{"family":"Horvath","given":"Steve"}],"citation-key":"langfelder_wgcna_2008","container-title":"BMC Bioinformatics","container-title-short":"BMC Bioinformatics","DOI":"10.1186/1471-2105-9-559","ISSN":"1471-2105","issue":"1","issued":{"date-parts":[[2008,12,29]]},"page":"559","source":"BioMed Central","title":"WGCNA: an R package for weighted correlation network analysis","title-short":"WGCNA","type":"article-journal","URL":"https://doi.org/10.1186/1471-2105-9-559","volume":"9"},
  {"id":"lawrenceSoftwareComputingAnnotating2013","abstract":"We describe Bioconductor infrastructure for representing and computing on annotated genomic ranges and integrating genomic data with the statistical computing features of R and its extensions. At the core of the infrastructure are three packages: IRanges, GenomicRanges, and GenomicFeatures. These packages provide scalable data structures for representing annotated ranges on the genome, with special support for transcript structures, read alignments and coverage vectors. Computational facilities include efficient algorithms for overlap and nearest neighbor detection, coverage calculation and other range operations. This infrastructure directly supports more than 80 other Bioconductor packages, including those for sequence analysis, differential expression analysis and visualization.","author":[{"family":"Lawrence","given":"Michael"},{"family":"Huber","given":"Wolfgang"},{"family":"Pagès","given":"Hervé"},{"family":"Aboyoun","given":"Patrick"},{"family":"Carlson","given":"Marc"},{"family":"Gentleman","given":"Robert"},{"family":"Morgan","given":"Martin T."},{"family":"Carey","given":"Vincent J."}],"citation-key":"lawrenceSoftwareComputingAnnotating2013","container-title":"PLoS computational biology","container-title-short":"PLoS Comput Biol","DOI":"10.1371/journal.pcbi.1003118","ISSN":"1553-7358","issue":"8","issued":{"date-parts":[[2013]]},"language":"eng","page":"e1003118","PMCID":"PMC3738458","PMID":"23950696","source":"PubMed","title":"Software for computing and annotating genomic ranges","type":"article-journal","volume":"9"},
  {"id":"lemoine_gwenacoexpression_2021","abstract":"Background\nNetwork-based analysis of gene expression through co-expression networks can be used to investigate modular relationships occurring between genes performing different biological functions. An extended description of each of the network modules is therefore a critical step to understand the underlying processes contributing to a disease or a phenotype. Biological integration, topology study and conditions comparison (e.g. wild vs mutant) are the main methods to do so, but to date no tool combines them all into a single pipeline.\n\nResults\nHere we present GWENA, a new R package that integrates gene co-expression network construction and whole characterization of the detected modules through gene set enrichment, phenotypic association, hub genes detection, topological metric computation, and differential co-expression. To demonstrate its performance, we applied GWENA on two skeletal muscle datasets from young and old patients of GTEx study. Remarkably, we prioritized a gene whose involvement was unknown in the muscle development and growth. Moreover, new insights on the variations in patterns of co-expression were identified. The known phenomena of connectivity loss associated with aging was found coupled to a global reorganization of the relationships leading to expression of known aging related functions.\n\nConclusion\nGWENA is an R package available through Bioconductor (https://bioconductor.org/packages/release/bioc/html/GWENA.html) that has been developed to perform extended analysis of gene co-expression networks. Thanks to biological and topological information as well as differential co-expression, the package helps to dissect the role of genes relationships in diseases conditions or targeted phenotypes. GWENA goes beyond existing packages that perform co-expression analysis by including new tools to fully characterize modules, such as differential co-expression, additional enrichment databases, and network visualization.\n\nSupplementary Information\nThe online version contains supplementary material available at 10.1186/s12859-021-04179-4.","accessed":{"date-parts":[[2021,5,28]]},"author":[{"family":"Lemoine","given":"Gwenaëlle G."},{"family":"Scott-Boyer","given":"Marie-Pier"},{"family":"Ambroise","given":"Bathilde"},{"family":"Périn","given":"Olivier"},{"family":"Droit","given":"Arnaud"}],"citation-key":"lemoine_gwenacoexpression_2021","container-title":"BMC Bioinformatics","container-title-short":"BMC Bioinformatics","DOI":"10.1186/s12859-021-04179-4","ISSN":"1471-2105","issued":{"date-parts":[[2021,5,25]]},"PMCID":"PMC8152313","PMID":"null","source":"PubMed Central","title":"GWENA: gene co-expression networks analysis and extended modules characterization in a single Bioconductor package","title-short":"GWENA","type":"article-journal","URL":"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8152313/","volume":"22"},
  {"id":"mitchellUntargetedLipidomicsNonSmall2021","abstract":"Lung cancer remains the leading cause of cancer death worldwide and non-small cell lung carcinoma (NSCLC) represents 85% of newly diagnosed lung cancers. In this study, we utilized our untargeted assignment tool Small Molecule Isotope Resolved Formula Enumerator (SMIRFE) and ultra-high-resolution Fourier transform mass spectrometry to examine lipid profile differences between paired cancerous and non-cancerous lung tissue samples from 86 patients with suspected stage I or IIA primary NSCLC. Correlation and co-occurrence analysis revealed significant lipid profile differences between cancer and non-cancer samples. Further analysis of machine-learned lipid categories for the differentially abundant molecular formulas identified a high abundance sterol, high abundance and high m/z sphingolipid, and low abundance glycerophospholipid metabolic phenotype across the NSCLC samples. At the class level, higher abundances of sterol esters and lower abundances of cardiolipins were observed suggesting altered stearoyl-CoA desaturase 1 (SCD1) or acetyl-CoA acetyltransferase (ACAT1) activity and altered human cardiolipin synthase 1 or lysocardiolipin acyltransferase activity respectively, the latter of which is known to confer apoptotic resistance. The presence of a shared metabolic phenotype across a variety of genetically distinct NSCLC subtypes suggests that this phenotype is necessary for NSCLC development and may result from multiple distinct genetic lesions. Thus, targeting the shared affected pathways may be beneficial for a variety of genetically distinct NSCLC subtypes.","accessed":{"date-parts":[[2022,1,6]]},"author":[{"family":"Mitchell","given":"Joshua M."},{"family":"Flight","given":"Robert M."},{"family":"Moseley","given":"Hunter N. B."}],"citation-key":"mitchellUntargetedLipidomicsNonSmall2021","container-title":"Metabolites","DOI":"10.3390/metabo11110740","issue":"11","issued":{"date-parts":[[2021,11]]},"language":"en","number":"11","page":"740","publisher":"Multidisciplinary Digital Publishing Institute","source":"www.mdpi.com","title":"Untargeted Lipidomics of Non-Small Cell Lung Carcinoma Demonstrates Differentially Abundant Lipid Classes in Cancer vs. Non-Cancer Tissue","type":"article-journal","URL":"https://www.mdpi.com/2218-1989/11/11/740","volume":"11"},
  {"id":"moseleyErrorAnalysisPropagation2013","abstract":"Error analysis plays a fundamental role in describing the uncertainty in experimental results. It has several fundamental uses in metabolomics including experimental design, quality control of experiments, the selection of appropriate statistical methods, and the determination of uncertainty in results. Furthermore, the importance of error analysis has grown with the increasing number, complexity, and heterogeneity of measurements characteristic of ‘omics research. The increase in data complexity is particularly problematic for metabolomics, which has more heterogeneity than other omics technologies due to the much wider range of molecular entities detected and measured. This review introduces the fundamental concepts of error analysis as they apply to a wide range of metabolomics experimental designs and it discusses current methodologies for determining the propagation of uncertainty in appropriate metabolomics data analysis. These methodologies include analytical derivation and approximation techniques, Monte Carlo error analysis, and error analysis in metabolic inverse problems. Current limitations of each methodology with respect to metabolomics data analysis are also discussed.","accessed":{"date-parts":[[2021,7,15]]},"author":[{"family":"Moseley","given":"Hunter N. B."}],"citation-key":"moseleyErrorAnalysisPropagation2013","container-title":"Computational and Structural Biotechnology Journal","container-title-short":"Computational and Structural Biotechnology Journal","DOI":"10.5936/csbj.201301006","ISSN":"2001-0370","issue":"5","issued":{"date-parts":[[2013,1,1]]},"language":"en","page":"e201301006","source":"ScienceDirect","title":"Error Analysis and Propagation in Metabolomics Data Analysis","type":"article-journal","URL":"https://www.sciencedirect.com/science/article/pii/S2001037014600490","volume":"4"},
  {"id":"pearson_notes_1920","accessed":{"date-parts":[[2021,5,25]]},"author":[{"family":"Pearson","given":"Karl"}],"citation-key":"pearson_notes_1920","container-title":"Biometrika","container-title-short":"Biometrika","DOI":"10.1093/biomet/13.1.25","ISSN":"0006-3444","issue":"1","issued":{"date-parts":[[1920,10,1]]},"page":"25-45","source":"Silverchair","title":"Notes on the History of Correlation","type":"article-journal","URL":"https://doi.org/10.1093/biomet/13.1.25","volume":"13"},
  {"id":"raykovEvaluationLatentConstruct2012","accessed":{"date-parts":[[2021,6,18]]},"author":[{"family":"Raykov","given":"Tenko"}],"citation-key":"raykovEvaluationLatentConstruct2012","container-title":"British Journal of Mathematical and Statistical Psychology","DOI":"10.1348/000711010X498162","ISSN":"00071102","issue":"1","issued":{"date-parts":[[2012,2]]},"language":"en","page":"19-31","source":"DOI.org (Crossref)","title":"Evaluation of latent construct correlations in the presence of missing data: A note on a latent variable modelling approach: Latent correlations with missing data","title-short":"Evaluation of latent construct correlations in the presence of missing data","type":"article-journal","URL":"http://doi.wiley.com/10.1348/000711010X498162","volume":"65"},
  {"id":"rcoreteam_rlanguage_2020","author":[{"literal":"R Core Team"}],"citation-key":"rcoreteam_rlanguage_2020","event-place":"Vienna, Austria","issued":{"date-parts":[[2020]]},"publisher":"R Foundation for Statistical Computing","publisher-place":"Vienna, Austria","title":"R: A language and environment for statistical computing","type":"book","version":"4.0"},
  {"id":"rodgers_13_1988","abstract":"In 1885, Sir Francis Galton first defined the term “regression” and completed the theory of bivariate correlation. A decade later, Karl Pearson developed the index that we still use to measure correlation, Pearson's r. Our article is written in recognition of the 100th anniversary of Galton's first discussion of regression and correlation. We begin with a brief history. Then we present 13 different formulas, each of which represents a different computational and conceptual definition of r. Each formula suggests a different way of thinking about this index, from algebraic, geometric, and trigonometric settings. We show that Pearson's r (or simple functions of r) may variously be thought of as a special type of mean, a special type of variance, the ratio of two means, the ratio of two variances, the slope of a line, the cosine of an angle, and the tangent to an ellipse, and may be looked at from several other interesting perspectives.","accessed":{"date-parts":[[2021,5,25]]},"author":[{"family":"Rodgers","given":"Joseph Lee"},{"family":"Nicewander","given":"W. Alan"}],"citation-key":"rodgers_13_1988","container-title":"The American Statistician","DOI":"10.1080/00031305.1988.10475524","ISSN":"0003-1305","issue":"1","issued":{"date-parts":[[1988,2,1]]},"note":"_eprint: https://doi.org/10.1080/00031305.1988.10475524","page":"59-66","publisher":"Taylor & Francis","source":"Taylor and Francis+NEJM","title":"Thirteen Ways to Look at the Correlation Coefficient","type":"article-journal","URL":"https://doi.org/10.1080/00031305.1988.10475524","volume":"42"},
  {"id":"schurchEvaluationToolsDifferential2016","abstract":"An RNA-seq experiment with 48 biological replicates in each of 2 conditions was performed to determine the number of biological replicates ($n_r$) required, and to identify the most effective statistical analysis tools for identifying differential gene expression (DGE). When $n_r=3$, seven of the nine tools evaluated give true positive rates (TPR) of only 20 to 40 percent. For high fold-change genes ($|log_{2}(FC)|\\gt2$) the TPR is $\\gt85$ percent. Two tools performed poorly; over- or under-predicting the number of differentially expressed genes. Increasing replication gives a large increase in TPR when considering all DE genes but only a small increase for high fold-change genes. Achieving a TPR $\\gt85$% across all fold-changes requires $n_r\\gt20$. For future RNA-seq experiments these results suggest $n_r\\gt6$, rising to $n_r\\gt12$ when identifying DGE irrespective of fold-change is important. For $6 \\lt n_r \\lt 12$, superior TPR makes edgeR the leading tool tested. For $n_r \\ge12$, minimizing false positives is more important and DESeq outperforms the other tools.","accessed":{"date-parts":[[2021,10,21]]},"author":[{"family":"Schurch","given":"Nicholas J."},{"family":"Schofield","given":"Pieta"},{"family":"Gierliński","given":"Marek"},{"family":"Cole","given":"Christian"},{"family":"Sherstnev","given":"Alexander"},{"family":"Singh","given":"Vijender"},{"family":"Wrobel","given":"Nicola"},{"family":"Gharbi","given":"Karim"},{"family":"Simpson","given":"Gordon G."},{"family":"Owen-Hughes","given":"Tom"},{"family":"Blaxter","given":"Mark"},{"family":"Barton","given":"Geoffrey J."}],"citation-key":"schurchEvaluationToolsDifferential2016","container-title":"RNA","container-title-short":"RNA","DOI":"10.1261/rna.053959.115","ISSN":"1355-8382, 1469-9001","issue":"6","issued":{"date-parts":[[2016,6]]},"page":"839-851","source":"arXiv.org","title":"Evaluation of tools for differential gene expression analysis by RNA-seq on a 48 biological replicate experiment","type":"article-journal","URL":"http://arxiv.org/abs/1505.02017","volume":"22"},
  {"id":"schurchHowManyBiological2016","abstract":"RNA-seq is now the technology of choice for genome-wide differential gene expression experiments, but it is not clear how many biological replicates are needed to ensure valid biological interpretation of the results or which statistical tools are best for analyzing the data. An RNA-seq experiment with 48 biological replicates in each of two conditions was performed to answer these questions and provide guidelines for experimental design. With three biological replicates, nine of the 11 tools evaluated found only 20%–40% of the significantly differentially expressed (SDE) genes identified with the full set of 42 clean replicates. This rises to >85% for the subset of SDE genes changing in expression by more than fourfold. To achieve >85% for all SDE genes regardless of fold change requires more than 20 biological replicates. The same nine tools successfully control their false discovery rate at ≲5% for all numbers of replicates, while the remaining two tools fail to control their FDR adequately, particularly for low numbers of replicates. For future RNA-seq experiments, these results suggest that at least six biological replicates should be used, rising to at least 12 when it is important to identify SDE genes for all fold changes. If fewer than 12 replicates are used, a superior combination of true positive and false positive performances makes edgeR and DESeq2 the leading tools. For higher replicate numbers, minimizing false positives is more important and DESeq marginally outperforms the other tools.","accessed":{"date-parts":[[2021,11,25]]},"author":[{"family":"Schurch","given":"Nicholas J."},{"family":"Schofield","given":"Pietá"},{"family":"Gierliński","given":"Marek"},{"family":"Cole","given":"Christian"},{"family":"Sherstnev","given":"Alexander"},{"family":"Singh","given":"Vijender"},{"family":"Wrobel","given":"Nicola"},{"family":"Gharbi","given":"Karim"},{"family":"Simpson","given":"Gordon G."},{"family":"Owen-Hughes","given":"Tom"},{"family":"Blaxter","given":"Mark"},{"family":"Barton","given":"Geoffrey J."}],"citation-key":"schurchHowManyBiological2016","container-title":"RNA","container-title-short":"RNA","DOI":"10.1261/rna.053959.115","ISSN":"1355-8382","issue":"6","issued":{"date-parts":[[2016,6]]},"page":"839-851","PMCID":"PMC4878611","PMID":"27022035","source":"PubMed Central","title":"How many biological replicates are needed in an RNA-seq experiment and which differential expression tool should you use?","type":"article-journal","URL":"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4878611/","volume":"22"},
  {"id":"sefidianEstimatingMissingData2020","abstract":"The accurate estimation of missing data plays a vital role in ensuring a high level of data quality. The missing values should be imputed before performing data mining, machine learning, and other data processing tasks. Ten correlation-based imputation methods are proposed in this paper. All of these methods try to maximize the correlation between a missing feature and other features. The maximization is achieved by selecting segments of data that have strong correlations. The proposed approach involves the following main steps to impute each missing instance. First, a base set is selected from complete instances. Second, data segments with strong correlations are generated using the base set and the rest of the complete instances. Finally, each missing value is imputed by applying linear models to the discovered segments of data. This study considers seven real datasets from different fields with different missing rates. The imputation quality of the proposed methods is compared to those of seven other imputation approaches in terms of three well-known evaluation criteria. The experimental results reveal that the proposed approach has better imputation performance than competing imputation techniques in most cases.","accessed":{"date-parts":[[2021,7,9]]},"author":[{"family":"Sefidian","given":"Amir Masoud"},{"family":"Daneshpour","given":"Negin"}],"citation-key":"sefidianEstimatingMissingData2020","container-title":"Applied Soft Computing","container-title-short":"Applied Soft Computing","DOI":"10.1016/j.asoc.2020.106249","ISSN":"1568-4946","issued":{"date-parts":[[2020,6,1]]},"language":"en","page":"106249","source":"ScienceDirect","title":"Estimating missing data using novel correlation maximization based methods","type":"article-journal","URL":"https://www.sciencedirect.com/science/article/pii/S1568494620301897","volume":"91"},
  {"id":"szklarczyk_string_2017","abstract":"A system-wide understanding of cellular function requires knowledge of all functional interactions between the expressed proteins. The STRING database aims to collect and integrate this information, by consolidating known and predicted protein-protein association data for a large number of organisms. The associations in STRING include direct (physical) interactions, as well as indirect (functional) interactions, as long as both are specific and biologically meaningful. Apart from collecting and reassessing available experimental data on protein-protein interactions, and importing known pathways and protein complexes from curated databases, interaction predictions are derived from the following sources: (i) systematic co-expression analysis, (ii) detection of shared selective signals across genomes, (iii) automated text-mining of the scientific literature and (iv) computational transfer of interaction knowledge between organisms based on gene orthology. In the latest version 10.5 of STRING, the biggest changes are concerned with data dissemination: the web frontend has been completely redesigned to reduce dependency on outdated browser technologies, and the database can now also be queried from inside the popular Cytoscape software framework. Further improvements include automated background analysis of user inputs for functional enrichments, and streamlined download options. The STRING resource is available online, at http://string-db.org/.","author":[{"family":"Szklarczyk","given":"Damian"},{"family":"Morris","given":"John H."},{"family":"Cook","given":"Helen"},{"family":"Kuhn","given":"Michael"},{"family":"Wyder","given":"Stefan"},{"family":"Simonovic","given":"Milan"},{"family":"Santos","given":"Alberto"},{"family":"Doncheva","given":"Nadezhda T."},{"family":"Roth","given":"Alexander"},{"family":"Bork","given":"Peer"},{"family":"Jensen","given":"Lars J."},{"family":"Mering","given":"Christian","non-dropping-particle":"von"}],"citation-key":"szklarczyk_string_2017","container-title":"Nucleic Acids Research","container-title-short":"Nucleic Acids Res","DOI":"10.1093/nar/gkw937","ISSN":"1362-4962","issue":"D1","issued":{"date-parts":[[2017,1,4]]},"language":"eng","page":"D362-D368","PMCID":"PMC5210637","PMID":"27924014","source":"PubMed","title":"The STRING database in 2017: quality-controlled protein-protein association networks, made broadly accessible","title-short":"The STRING database in 2017","type":"article-journal","volume":"45"},
  {"id":"TxDbScerevisiaeUCSC","abstract":"Exposes an annotation databases generated from UCSC by exposing these as TxDb objects","accessed":{"date-parts":[[2021,7,7]]},"citation-key":"TxDbScerevisiaeUCSC","container-title":"Bioconductor","language":"en-US","title":"TxDb.Scerevisiae.UCSC.sacCer3.sgdGene","type":"webpage","URL":"http://bioconductor.org/packages/TxDb.Scerevisiae.UCSC.sacCer3.sgdGene/"},
  {"id":"vaughanFurrrApplyMapping2021","author":[{"family":"Vaughan","given":"Davis"},{"family":"Dancho","given":"Matt"}],"citation-key":"vaughanFurrrApplyMapping2021","genre":"manual","issued":{"date-parts":[[2021]]},"title":"furrr: Apply mapping functions in parallel using futures","type":"report","URL":"https://CRAN.R-project.org/package=furrr"},
  {"id":"virtanen_scipy_2020","abstract":"SciPy is an open-source scientific computing library for the Python programming language. Since its initial release in 2001, SciPy has become a de facto standard for leveraging scientific algorithms in Python, with over 600 unique code contributors, thousands of dependent packages, over 100,000 dependent repositories and millions of downloads per year. In this work, we provide an overview of the capabilities and development practices of SciPy 1.0 and highlight some recent technical developments.","accessed":{"date-parts":[[2021,5,26]]},"author":[{"family":"Virtanen","given":"Pauli"},{"family":"Gommers","given":"Ralf"},{"family":"Oliphant","given":"Travis E."},{"family":"Haberland","given":"Matt"},{"family":"Reddy","given":"Tyler"},{"family":"Cournapeau","given":"David"},{"family":"Burovski","given":"Evgeni"},{"family":"Peterson","given":"Pearu"},{"family":"Weckesser","given":"Warren"},{"family":"Bright","given":"Jonathan"},{"family":"Walt","given":"Stéfan J.","non-dropping-particle":"van der"},{"family":"Brett","given":"Matthew"},{"family":"Wilson","given":"Joshua"},{"family":"Millman","given":"K. Jarrod"},{"family":"Mayorov","given":"Nikolay"},{"family":"Nelson","given":"Andrew R. J."},{"family":"Jones","given":"Eric"},{"family":"Kern","given":"Robert"},{"family":"Larson","given":"Eric"},{"family":"Carey","given":"C. J."},{"family":"Polat","given":"İlhan"},{"family":"Feng","given":"Yu"},{"family":"Moore","given":"Eric W."},{"family":"VanderPlas","given":"Jake"},{"family":"Laxalde","given":"Denis"},{"family":"Perktold","given":"Josef"},{"family":"Cimrman","given":"Robert"},{"family":"Henriksen","given":"Ian"},{"family":"Quintero","given":"E. A."},{"family":"Harris","given":"Charles R."},{"family":"Archibald","given":"Anne M."},{"family":"Ribeiro","given":"Antônio H."},{"family":"Pedregosa","given":"Fabian"},{"family":"Mulbregt","given":"Paul","non-dropping-particle":"van"}],"citation-key":"virtanen_scipy_2020","container-title":"Nature Methods","DOI":"10.1038/s41592-019-0686-2","ISSN":"1548-7105","issue":"3","issued":{"date-parts":[[2020,3]]},"language":"en","number":"3","page":"261-272","publisher":"Nature Publishing Group","source":"www.nature.com","title":"SciPy 1.0: fundamental algorithms for scientific computing in Python","title-short":"SciPy 1.0","type":"article-journal","URL":"https://www.nature.com/articles/s41592-019-0686-2","volume":"17"}
]
